Repository: rubix0307/finance
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, ru, uk

source: Week
es: Semana
ru: Неделя
uk: Тиждень

source: Month
es: Mes
ru: Месяц
uk: Місяць

source: Year
es: Año
ru: Год
uk: Рік

source: Currency
es: Código de la moneda
ru: Валюта
uk: Валюта

source: Preview
es: Vista previa
uk: Попередній перегляд

source: Color preview
es: Vista previa del color
uk: Попередній перегляд кольору

source: Date
es: Fecha
uk: Дата

source: Section
es: Sección
uk: Кімната

source: Shop
es: Tienda
uk: Магазин

source: The Date field is required
es: El campo de fecha es obligatorio
uk: Поле дати є обов’язковим

source: The date cannot be in the future
es: La fecha no puede estar en el futuro
uk: Дата не може бути в майбутньому

source: The receipt must contain at least one item
es: El recibo debe contener al menos un artículo
uk: Чек повинен містити щонайменше один товар

source: Total
ru: Всего
uk: Разом

source: Add item
es: Agregar artículo
uk: Додати товар

source: Save
es: Guardar
ru: Сохранить
uk: Зберегти

source: Delete this receipt?
es: ¿Eliminar este recibo?
uk: Видалити цей чек?

source: Delete receipt
es: Eliminar recibo
uk: Видалити чек

source: Count of users
es: Cantidad de usuarios
uk: Кількість користувачів

source: Start
es: Inicio
ru: Начало
uk: Початок

source: End
es: Fin
ru: Конец
uk: Кінець

source: No expiration
es: Sin vencimiento
ru: Без срока
uk: Без терміну дії

source: Subscribe
es: Suscribirse
ru: Подписаться
uk: Підписатися

source: FAQ
es: Preguntas frecuentes
ru: Часто задаваемые вопросы
uk: Часті запитання

source: Account and support
es: Cuenta y asistencia
ru: Аккаунт и поддержка
uk: Акаунт та підтримка

source: How to contact the developers?
es: ¿Cómo contactar con los desarrolladores?
ru: Как связаться с разработчиками?
uk: Як зв’язатися з розробниками?

source: Via the feedback form in “Account” → “Feedback” section
es: A través del formulario de comentarios en “Cuenta” → “Comentarios”
ru: Через форму обратной связи в разделе «Аккаунт» → «Обратная связь»
uk: Через форму зворотного зв’язку в розділі «Акаунт» → «Зворотній зв’язок»

source: Working with the bot
es: Trabajo con el bot
ru: Работа с ботом
uk: Робота з ботом

source: How to get started with the bot?
es: ¿Cómo empezar a utilizar el bot?
ru: Как начать работу с ботом?
uk: Як почати роботу з ботом?

source: Just send a photo of the receipt in the chat with the bot – it will automatically process the image and return the status
es: Simplemente envía una foto del recibo en el chat con el bot: procesará automáticamente la imagen y devolverá el estado
ru: Просто отправьте фото чека в чат с ботом — он автоматически обработает изображение и вернёт статус
uk: Просто надішліть фото чека в чаті з ботом — він автоматично обробить зображення та поверне статус

source: How to change the language in the bot?
es: ¿Cómo cambiar el idioma en el bot?
ru: Как сменить язык в боте?
uk: Як змінити мову в боті?

source: In the bot menu or in the web application, select “Account” → “Language” and choose the desired one
es: En el menú del bot o en la aplicación web, selecciona “Cuenta” → “Idioma” y elige el deseado
ru: В меню бота или в веб-приложении выберите «Аккаунт» → «Язык» и укажите нужный
uk: У меню бота або у вебзастосунку виберіть «Акаунт» → «Мова» та вкажіть потрібну

source: Web application
es: Aplicación web
ru: Веб-приложение
uk: Вебзастосунок

source: How to select a period for analytics?
es: ¿Cómo seleccionar un período para el análisis?
ru: Как выбрать период для аналитики?
uk: Як вибрати період для аналітики?

source: On the main page of the webapp there are three fixed ranges available: week, month, and year. One of them is active by default. In the upcoming update there will be a choice of a custom period via the calendar
es: En la página principal de la aplicación web hay tres rangos fijos disponibles: semana, mes y año. Por defecto está activo uno de ellos. En la próxima actualización habrá opción de elegir un período personalizado mediante el calendario
ru: На главной странице webapp доступны три фиксированных диапазона: неделя, месяц и год. По умолчанию активен один из них. В ближайшем обновлении появится возможность выбрать произвольный период через календарь
uk: На головній сторінці вебзастосунку доступні три фіксовані діапазони: тиждень, місяць і рік. За замовчуванням активний один з них. У найближчому оновленні з’явиться вибір довільного періоду через календар

source: Which reports and charts are currently available?
es: ¿Qué informes y gráficos están disponibles actualmente?
ru: Какие отчёты и графики есть сейчас?
uk: Які звіти та графіки доступні зараз?

source: Total spending amount, pie chart
es: Monto total de gastos, gráfico circular
ru: Общая сумма трат, круговая диаграмма
uk: Загальна сума витрат, кругова діаграма

source: Rooms
es: Salas
ru: Комнаты
uk: Кімнати

source: What is a “room”?
es: ¿Qué es una “sala”?
ru: Что такое «комната»?
uk: Що таке «кімната»?

source: It's a shared chat-cash register, where you can see receipts from all participants and overall charts
es: Es un chat-caja compartido, donde puedes ver los recibos de todos los participantes y gráficos generales
ru: Это общий чат-касса, где видны чеки всех участников и общие графики
uk: Це спільний чат-реєстратор, де видно чеки всіх учасників і загальні графіки

source: How is a room created?
es: ¿Cómo se crea una sala?
ru: Как создаётся комната?
uk: Як створюється кімната?

source: The first room is automatically created upon first entering the bot. New rooms cannot be created yet, but you can be invited to an existing one
es: La primera sala se crea automáticamente al entrar por primera vez al bot. Aún no se pueden crear nuevas salas, pero puedes ser invitado a una ya existente
ru: Первая комната создаётся автоматически при первом входе в бот. Новые комнаты пока создать нельзя, но вас могут пригласить в уже существующую
uk: Перша кімната створюється автоматично під час першого входу в бот. Нові кімнати створювати наразі не можна, але вас можуть запросити до вже існуючої

source: How to invite others to a room?
es: ¿Cómo invitar a otros a una sala?
ru: Как пригласить других в комнату?
uk: Як запросити інших до кімнати?

source: In the section menu, click the “Invite” button. A bot chat will open with a button to select users
es: En el menú de la sección, haz clic en el botón “Invitar”. Se abrirá un chat con el bot con un botón para seleccionar usuarios
ru: В меню раздела нажмите кнопку «Пригласить», откроется чат бота с кнопкой для выбора пользователей
uk: У меню розділу натисніть кнопку «Запросити», відкриється чат бота з кнопкою для вибору користувачів

source: Who can add and remove participants?
es: ¿Quién puede añadir y eliminar participantes?
ru: Кто может добавлять и удалять участников?
uk: Хто може додавати та видаляти учасників?

source: Only the room owner. Regular participants can remove themselves.
es: Solo el propietario de la sala. Los participantes regulares pueden eliminarse a sí mismos.
ru: Только владелец комнаты. Обычные участники могут удалить себя сами.
uk: Тільки власник кімнати. Звичайні учасники можуть видалити себе самостійно.

source: How to switch rooms and set one as default?
es: ¿Cómo cambiar de sala y establecer una como predeterminada?
ru: Как сменить комнату и установить её по умолчанию?
uk: Як перемикатися між кімнатами та встановити одну за замовчуванням?

source: If you have multiple rooms, switching arrows will appear. The “Set as default” button makes the current room the primary one. If you are removed from someone else's room, your own room will become the default again.
es: Si tienes varias salas, aparecerán flechas para cambiar. El botón “Establecer como predeterminada” convierte la sala actual en la principal. Si te eliminan de la sala de otro, tu propia sala volverá a ser la predeterminada.
ru: Если у вас несколько комнат, появятся стрелки переключения. Кнопка «Установить по умолчанию» делает текущую комнату основной. Если вас удалили из чужой комнаты, по умолчанию восстановится ваша собственная
uk: Якщо у вас декілька кімнат, з’являться стрілки перемикання. Кнопка «Встановити за замовчуванням» робить поточну кімнату основною. Якщо вас видалять з чужої кімнати, за замовчуванням знову відновиться ваша власна

source: Can you rename a room or change the currency?
es: ¿Se puede renombrar una sala o cambiar la moneda?
ru: Можно ли переименовать комнату или сменить валюту?
uk: Чи можна перейменувати кімнату або змінити валюту?

source: Any participant can set their own local name for the room and choose the currency for display charts. The currency does not affect others. The room name set by the owner will be displayed to all participants who have not set their own room name.
es: Cualquier participante puede asignar su propio nombre local a la sala y elegir la moneda para mostrar los gráficos. La moneda no afecta a los demás. El nombre de la sala establecido por el propietario se mostrará a todos los participantes que no hayan establecido su propio nombre.
ru: Любой участник может задать своё локальное название комнаты и выбрать валюту отображения графиков. Валюта никак не влияет на других. Название комнаты, заданное владельцем, будет отображаться тем участникам, у которых не задано собственное название.
uk: Будь-який учасник може задати власну локальну назву кімнати та обрати валюту для відображення графіків. Валюта не впливає на інших. Назва кімнати, встановлена власником, відображатиметься всім учасникам, які не задали власну назву кімнати.

source: Finance and charts
es: Finanzas y gráficos
ru: Финансы и графики
uk: Фінанси та графіки

source: Which currencies are supported?
es: ¿Qué monedas son compatibles?
ru: Какие валюты поддерживаются?
uk: Які валюти підтримуються?

source: All world currencies are supported. All amounts are converted into the default currency using current exchange rates
es: Se admiten todas las monedas del mundo. Todos los montos se convierten a la moneda predeterminada usando tipos de cambio actualizados
ru: Поддерживаются все мировые валюты. Все суммы конвертируются в валюту по умолчанию с помощью актуальных курсов
uk: Підтримуються всі світові валюти. Всі суми конвертуються в валюту за замовчуванням за актуальними курсами

source: How to see detailed information for a category on the chart?
es: ¿Cómo ver información detallada de una categoría en el gráfico?
ru: Как увидеть детальную информацию по категории на диаграмме?
uk: Як побачити детальну інформацію по категорії на діаграмі?

source: Click on a segment – a window will appear with the category, amount in the room's currency, and a breakdown by original currencies
es: Haz clic en un segmento: aparecerá una ventana con la categoría, el monto en la moneda de la sala y un desglose por monedas originales
ru: Нажмите на сегмент — появится окошко с категорией, суммой в валюте комнаты и детализацией по исходным валютам
uk: Клікніть на сегмент — з’явиться вікно з категорією, сумою в валюті кімнати та деталізацією по оригінальним валютам

source: Can receipts be filtered?
es: ¿Se pueden filtrar los recibos?
ru: Можно ли фильтровать чеки?
uk: Чи можна фільтрувати чеки?

source: Currently filtering is only by period. In future updates, filters by people and categories will be added.
es: Actualmente el filtrado es solo por período. En futuras actualizaciones se añadirán filtros por personas y categorías.
ru: Пока фильтрация только по периоду. В следующих обновлениях добавятся фильтры по людям и категориям
uk: Наразі фільтрація тільки за періодом. У майбутніх оновленнях будуть додані фільтри за користувачами та категоріями

source: What can be edited in a receipt?
es: ¿Qué se puede editar en un recibo?
ru: Что можно отредактировать в чеке?
uk: Що можна редагувати в чеку?

source: Full editing is available to any participant, as well as receipt deletion.
es: La edición completa está disponible para cualquier participante, así como la eliminación del recibo.
ru: Полноценное редактирование доступно любому участнику, а также удаление чека.
uk: Повне редагування доступне будь-якому учаснику, а також видалення чека.

source: Expenses
es: Gastos
ru: Траты
uk: Витрати

source: Edit
es: Editar
uk: Редагувати

source: No available spending
es: No hay gastos disponibles
ru: Нет доступных трат
uk: Немає доступних витрат

source: Add member
es: Añadir miembro
ru: Добавить участника
uk: Додати учасника

source: Default
es: Predeterminado
ru: По умолчанию
uk: За замовчуванням

source: to display charts
es: para mostrar gráficos
ru: для отображения графиков
uk: для відображення графіків

source: Code of currency
es: Código de la moneda
ru: Код валюты
uk: Код валюти

source: Room
es: Habitación
ru: Комната
uk: Кімната

source: Name
es: Nombre
ru: Название
uk: Назва

source: Owner
es: Propietario
ru: Владелец
uk: Власник

source: Confirm
es: Confirmar
ru: Подтвердить
uk: Підтвердити

source: Delete
es: Eliminar
ru: Удалить
uk: Видалити

source: Receipt
es: Recibo
ru: Чек
uk: Чек

source: 👋 Hello! It’s empty here for now
es: 👋 ¡Hola! Por ahora está vacío aquí
ru: 👋 Привет! Пока что здесь пусто
uk: 👋 Привіт! Тут поки що порожньо

source: To get it up and running, just send a photo of your receipt to our Telegram bot. It will quickly recognize your purchases and display beautiful charts here — how much you spent, on what, and more.
es: Para ponerlo en funcionamiento, simplemente envía una foto de tu recibo a nuestro bot de Telegram. Él reconocerá rápidamente tus compras y mostrará aquí hermosos gráficos: cuánto gastaste, en qué y más.
ru: Чтобы всё заработало, просто отправь фото чека в нашего Telegram‑бота. Он быстро распознает покупки и покажет здесь красивые графики — сколько потратил, на что, и не только
uk: Щоб запустити це, просто надішліть фото свого чеку нашому боту в Telegram. Він швидко розпізнає ваші покупки та покаже тут чудові діаграми — скільки ви витратили, на що і не тільки.

source: Give it a try right now — it’s simple and even a bit fun!
es: ¡Pruébalo ahora mismo: es sencillo e incluso un poco divertido!
ru: Попробуй прямо сейчас — это просто и даже немного интересно!
uk: Спробуйте прямо зараз — це просто і навіть трохи весело!

source: Features & Limits
es: Funciones y límites
uk: Функції та обмеження

source: Create payment links for selected tariffs in all languages (atomically)
es: Crear enlaces de pago para las tarifas seleccionadas en todos los idiomas (atómicamente)
ru: Создать ссылки для оплаты выбранных тарифов на всех языках (атомарно)
uk: Створити платіжні посилання для вибраних тарифів усіма мовами (атомарно)

source: Payment links for all selected plans in all languages have been created successfully
es: Los enlaces de pago para todos los planes seleccionados en todos los idiomas se han creado con éxito
ru: Ссылки на оплату для всех выбранных планов на всех языках были созданы успешно
uk: Платіжні посилання для всіх вибраних планів усіма мовами успішно створено

source: Error creating links:
es: Error al crear los enlaces:
ru: Ошибка создания ссылок
uk: Помилка створення посилань:

source: Choose language
es: Elija el idioma
ru: Выбери язык
uk: Обери мову

source: Language updated
es: Idioma actualizado
ru: Язык обновлен
uk: Мова оновлена

source: Language not updated
es: Idioma no actualizado
ru: Язык не обновлен
uk: Мова не оновлена

source: Open the app
es: Abre la aplicación
ru: Открыть приложение
uk: Відкрити додаток

source: Main page
es: Página principal
ru: Главная страница
uk: Головна сторінка

source: Language
es: Idioma
ru: Язык
uk: Мова

source: You can't perform this action, please check your subscription limits and capabilities
uk: Ви не можете виконати цю дію. Перевірте обмеження та можливості вашої підписки.

source: Hello! Finance Lens is a bot for tracking your expenses. Send me a photo of a receipt or a free-form text description of your expense, and I will analyze it and show a chart in the web app via the button below.
uk: Привіт! Finance Lens — це бот для відстеження ваших витрат. Надішліть мені фото чека або текстовий опис витрати у вільній формі, я проаналізую його та покажу графік у веб-застосунку за кнопкою нижче.

source: In line
es: En la cola
ru: В очереди
uk: У черзі

source: In progress
es: En progreso
ru: В процессе
uk: У процесі

source: Analysis completed
es: Análisis completado
ru: Анализ завершён
uk: Аналіз завершено

source: Analysis error
es: Error de análisis
ru: Ошибка анализа
uk: Помилка аналізу

source: The specified tariff plan was not found.
es: No se encontró el plan tarifario especificado
ru: Указанный тарифный план не найден
uk: Вказаний тарифний план не знайдено.

source: Subscription successfully completed
es: Suscripción completada con éxito
ru: Подписка успешно оформлена
uk: Підписку успішно оформлено.

source: You must be the owner of a room to add users to it
es: Debes ser el propietario de una sala para añadir usuarios a ella
ru: Вы должны быть владельцем комнаты, чтобы добавлять в неё пользователей
uk: Ви повинні бути власником кімнати, щоб додавати до неї користувачів

source: Add to room "%(section_name)s"
es: Agregar a la sala "%(section_name)s"
ru: Добавить в комнату "%(section_name)s"
uk: Додати до кімнати "%(section_name)s"

source: Use the button below to add users to the room "%(section_name)s"
es: Usa el botón de abajo para añadir usuarios a la sala "%(section_name)s"
ru: Используйте кнопку ниже, чтобы добавить пользователей в комнату "%(section_name)s"
uk: Скористайтеся кнопкою нижче, щоб додати користувачів до кімнати "%(section_name)s"

source: Room not found, users will not be added. Try again
es: Sala no encontrada, los usuarios no serán añadidos. Intenta de nuevo
ru: Комната не найдена, пользователи не будут добавлены. Попробуйте ещё раз
uk: Кімнату не знайдено, користувачів не буде додано. Спробуйте ще раз

source: Users added
es: Usuarios añadidos
ru: Пользователи добавлены
uk: Користувачів додано

source: Processed
es: Procesado
ru: Обработано
uk: Оброблено

source: Error
ru: Ошибка
uk: Помилка

source: Status
es: Estado
ru: Статус
uk: Статус

source: Successful
es: Exitoso
ru: Успешно
uk: Успішно

source: Used currencies
es: Divisas usadas
ru: Использованные валюты
uk: Використані валюти

source: Feedback
es: Comentarios
ru: Обратная связь
uk: Зворотний зв'язок

source: Message
es: Mensaje
ru: Сообщение
uk: Повідомлення

source: Send
es: Enviar
ru: Отправить
uk: Надіслати

source: Hello! Finance Lens is a bot for tracking your expenses. Send me a photo of a receipt or a free-form text description of your expense, and I will analyze it and show a chart in the web app via the button below.
es: ¡Hola! Finance Lens es un bot para hacer un seguimiento de tus gastos. Envíame una foto de un recibo o una descripción libre de tu gasto, y lo analizaré y te mostraré un gráfico en la aplicación web a través del botón de abajo.

source: Got questions?
es: ¿Tienes preguntas?

source: Receipts
ru: Чеки

source: Hello
ru: Привет
